1s/ERP/Conf/InformationRegisters/Лико_РегистрацияРассылкиСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_РегистрацияРассылкиСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектРассылки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Лико_ОбъектыОтправкиСообщений</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ТипыСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/Enums/СтатусыЗаказовПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказовПоставщикам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лико_Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лико_Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_РегистрацияРассылкиСообщений/Ext/ManagerModule.bsl
Процедура ЗарегестрироватьСообщение(ОбъектРассылки,ТипСообщения) Экспорт  //+Лико m.shenderov 18.10.2023
	
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей = РегистрыСведений.Лико_РегистрацияРассылкиСообщений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектРассылки.Установить(ОбъектРассылки);  
	НаборЗаписей.Отбор.ТипСообщения.Установить(ТипСообщения);
	
	
	ЗаказПоставщику=ПолучитьзаказПоставщику(ОбъектРассылки);
	
	Если Не ЗначениеЗаполнено(ЗаказПоставщику) Тогда
		Возврат; 
	КонецЕсли;
	
	
	ДокОбъект=ЗаказПоставщику.ПолучитьОбъект();
	
	ДокОбъект.ОбменДанными.Загрузка=Истина;
	ДокОбъект.Лико_ЕстьОплата=Истина;
	ДокОбъект.Записать();
	
	// <-- Начало Лико Яцун С. В. 23.10.2024 
	Если ЗаказПоставщику.Статус = Перечисления.СтатусыЗаказовПоставщикам.Согласован Тогда
		ВыделенныеСтроки = Новый Массив;
		ВыделенныеСтроки.Добавить(ЗаказПоставщику);
		ОбщегоНазначенияУТВызовСервера.УстановитьСтатусДокументов(ВыделенныеСтроки, "Подтвержден");		
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 23.10.2024
	
	Запись=НаборЗаписей.Добавить();
	Запись.ОбъектРассылки=ОбъектРассылки;
	Запись.ТипСообщения=ТипСообщения;
	Запись.Дата=ТекущаяДата();
	НаборЗаписей.Записать(Истина);
		 
КонецПроцедуры //-Лико m.shenderov 18.10.2023

Процедура УдалитьРегистрациюСообщения(ОбъектРассылки,ТипСообщения) Экспорт  //+Лико m.shenderov 18.10.2023
		 УстановитьПривилегированныйРежим(Истина);
		 НаборЗаписей = РегистрыСведений.Лико_РегистрацияРассылкиСообщений.СоздатьНаборЗаписей();
		 НаборЗаписей.Отбор.ОбъектРассылки.Установить(ОбъектРассылки);  
		 НаборЗаписей.Отбор.ТипСообщения.Установить(ТипСообщения);
		 НаборЗаписей.Записать();
		 
		 		 
КонецПроцедуры //-Лико m.shenderov 18.10.2023

	 
Функция ПолучитьзаказПоставщику(ОбъектРассылки) //+Лико m.shenderov 23.10.2023
		 Если   ЗначениеЗаполнено(ОбъектРассылки.Лико_ЗаказПоставщику) Тогда
			 Возврат ОбъектРассылки.Лико_ЗаказПоставщику;
		 КонецЕсли;
		 
		 Для каждого Платеж Из ОбъектРассылки.РасшифровкаПлатежа Цикл
			 Если ЗначениеЗаполнено(Платеж.Лико_ЗаказПоставщику) Тогда
				 Возврат Платеж.Лико_ЗаказПоставщику; 
			 КонецЕсли;
			 
		 КонецЦикла;
КонецФункции //-Лико m.shenderov 23.10.2023
